/* eslint-disable max-len */
import React from 'react';
import { Color } from '../../colors';
import { getSvgColor } from '../util';

export type IconProps = {
  /** fufoloopのカラープリセット
   * 省略した場合は#FFFFFFが指定される
   * */
  color?: Color;
  /** アイコンの使用可否
   * trueの場合、colorプリセットやfill値が無視されてdisabledカラーになる
   */
  disabled?: boolean;
  /** アイコンのカスタムカラー */
  fill?: string;
  /** アイコンのサイズ */
  size?: string | number;
  /** svgに指定するスタイル */
  styles?: React.CSSProperties;
  /** カスタムスタイル(cssModules & styled-component) */
  className?: string;
};

function Saler({ color, disabled = false, fill, size = '30px', styles, className }: IconProps) {
  const fillColor = getSvgColor(disabled, fill, color);

  return (
    <svg
      width={size}
      height={size}
      viewBox="0 0 30 30"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      xmlnsXlink="http://www.w3.org/1999/xlink"
      style={styles}
      className={className}
    >
      <title>logout</title>
      <desc>Created with Sketch.</desc>
      <g id="Saller" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
        <path
          d="M15,3.00097972 C16.5823328,3.00097972 21,2.75806163 21,9.92236584 C21,10.1641863 21.7387119,9.66055487 21.9728872,10.8211854 C22.0872914,11.3882003 21.5175578,13.8549102 20.1883441,14.4126673 C20.086019,14.4556043 20.148061,15.1684008 19.4247837,16.245828 C18.7015064,17.3232552 18.2552732,17.7232552 18.2552732,17.7232552 C18.2552732,17.7232552 18.2552732,20.0167598 18.2552732,20.0167598 C18.2552732,20.0167598 18.4922284,20.5130967 19.0627552,20.9873693 C19.3496932,21.2258976 19.3766883,21.2459591 20.1883441,21.6236999 C21,22.0014408 22.9900522,22.2140287 23.8967321,22.9238482 C24.3048114,23.2433244 24.6725673,24.1100899 25,25.5241446 C25,26.5080482 21.6666667,27 15,27 C8.33333333,27 5,26.5080482 5,25.5241446 C5.10511514,24.1644964 5.42622439,23.2977309 5.96332774,22.9238482 C6.62789741,22.4612349 9.34534836,21.7840442 9.66666667,21.6236999 C10.5184413,21.1986472 10.4855903,21.1479606 10.7115405,20.9873693 C11,20.7823502 11.7340825,20.0167598 11.7340825,20.0167598 C11.7340825,20.0167598 11.7340825,17.7232552 11.7340825,17.7232552 C11.7340825,17.7232552 10.6796388,16.6754246 10.4602299,16.245828 C10.1771577,15.69158 9.79620356,14.4126673 9.79620356,14.4126673 C8.6505414,14.5099979 7.8796357,11.9003865 8.04973451,10.8211854 C8.21983332,9.7419842 9.00067651,10.1985254 9.00067651,9.92236584 C9.00067651,3.00097972 13.4176672,3.00097972 15,3.00097972 Z"
          id="Rectangle"
          fill={fillColor}
        />
      </g>
    </svg>
  );
}

export default Saler;
