/* eslint-disable max-len */
import React from 'react';
import { Color } from '../../colors';
import { getSvgColor } from '../util';

export type IconProps = {
  /** fufoloopのカラープリセット
   * 省略した場合は#FFFFFFが指定される
   * */
  color?: Color;
  /** アイコンの使用可否
   * trueの場合、colorプリセットやfill値が無視されてdisabledカラーになる
   */
  disabled?: boolean;
  /** アイコンのカスタムカラー */
  fill?: string;
  /** アイコンのサイズ */
  size?: string | number;
  /** svgに指定するスタイル */
  styles?: React.CSSProperties;
  /** カスタムスタイル(cssModules & styled-component) */
  className?: string;
};

function Setting({ color, disabled = false, fill, size = '30px', styles, className }: IconProps) {
  const fillColor = getSvgColor(disabled, fill, color);

  return (
    <svg
      width={size}
      height={size}
      viewBox="0 0 27 27"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      xmlnsXlink="http://www.w3.org/1999/xlink"
      style={styles}
      className={className}
    >
      <title>setting</title>
      <desc>Created with Sketch.</desc>
      <g id="setting" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
        <rect x="0" y="0" width="27" height="27" />
        <g
          id="setting_icon"
          transform="translate(7.000000, 6.000000)"
          fill={fillColor}
          fillRule="nonzero"
        >
          <path
            d="M12.3551256,7.6825 C12.3821263,7.46375 12.4001267,7.23625 12.4001267,7 C12.4001267,6.76375 12.3821263,6.53625 12.3461254,6.3175 L13.8671611,5.1625 C14.0021643,5.0575 14.0381651,4.865 13.9571632,4.71625 L12.5171294,2.2925 C12.4271273,2.135 12.2381229,2.0825 12.0761191,2.135 L10.2850771,2.835 C9.90706819,2.555 9.51105891,2.3275 9.07004856,2.1525 L8.80004223,0.2975 C8.77304159,0.1225 8.620038,0 8.44003378,0 L5.55996622,0 C5.379962,0 5.23595862,0.1225 5.20895799,0.2975 L4.93895165,2.1525 C4.49794131,2.3275 4.09293181,2.56375 3.72392315,2.835 L1.93288113,2.135 C1.77087733,2.07375 1.5818729,2.135 1.49187079,2.2925 L0.0518370078,4.71625 C-0.0381651035,4.87375 -0.00216425897,5.0575 0.141839119,5.1625 L1.6628748,6.3175 C1.62687396,6.53625 1.59987332,6.7725 1.59987332,7 C1.59987332,7.2275 1.61787374,7.46375 1.65387459,7.6825 L0.132838908,8.8375 C-0.00216425897,8.9425 -0.0381651035,9.135 0.0428367967,9.28375 L1.48287058,11.7075 C1.57287269,11.865 1.76187712,11.9175 1.92388092,11.865 L3.71492294,11.165 C4.09293181,11.445 4.48894109,11.6725 4.92995144,11.8475 L5.19995777,13.7025 C5.23595862,13.8775 5.379962,14 5.55996622,14 L8.44003378,14 C8.620038,14 8.77304159,13.8775 8.79104201,13.7025 L9.06104835,11.8475 C9.50205869,11.6725 9.90706819,11.43625 10.2760769,11.165 L12.0671189,11.865 C12.2291227,11.92625 12.4181271,11.865 12.5081292,11.7075 L13.948163,9.28375 C14.0381651,9.12625 14.0021643,8.9425 13.8581609,8.8375 L12.3551256,7.6825 L12.3551256,7.6825 Z M7,9.625 C5.51496516,9.625 4.29993666,8.44375 4.29993666,7 C4.29993666,5.55625 5.51496516,4.375 7,4.375 C8.48503484,4.375 9.70006334,5.55625 9.70006334,7 C9.70006334,8.44375 8.48503484,9.625 7,9.625 Z"
            id="Shape"
          />
        </g>
      </g>
    </svg>
  );
}

export default Setting;
